
const newData = [
    {
      title:"台驻尼日利亚机构被强制摘除伪牌 王毅：赞赏！",
      author:"环球网综合",
      content:"【环球网综合报道】 2017年1月11日，外交部长王毅在阿布贾与尼日利亚外长奥尼亚马共同会见记者时表示，中方赞赏尼方坚持一个中国原则并采取果断措施解决影响两国政治互信的历史遗留问题。坚持一个中国原则是人心所向、大势所趋。王毅说，刚才我和奥尼亚马外长分别代表各自政府签署了关于坚持一个中国原则的联合声明。在这份声明中，尼方承认台湾是中国领土不可分割的一部分，表明一个中国政策是尼中战略伙伴的核心，明确承诺将不会同台湾地区发生任何官方往来。尼方还强调，支持中国为维护国家统一所作的一切努力。王毅指出，一个中国原则涉及中国核心利益，是中国同世界各国保持和发展友好关系的前提和基础。台湾地区的驻尼机构多年来从事与自己身份不相符，并明显违反一个中国原则的活动。去年4月，习近平主席同布哈里总统就坚持一个中国原则、维护两国关系政治基础达成重要共识。尼方履行承诺，最近采取一系列果断措施，严令台湾地区驻尼机构摘牌更名，迁出首都，消权减人，并禁止尼政府官员和机构同台湾发生任何官方往来，从而彻底解决了这一影响中尼政治互信的历史遗留问题，排除了干扰两国关系健康发展的政治障碍。",
      num:0,
      pinlun:[
         {
           person:"小明",
           text:"wwddawdadd"
         }
      ]
    },
    {
      title:"上行的业绩，下行的股价，万达院线到底出了什么问题",
      author:"娱乐调查局",
      content:"1月10日晚间，万达院线发布了2016年的经营简报。1月10日晚间，万达院线发布了2016年的经营简报。简报显示，公司去年实现营收111亿元，同比增长39%。其中，票房76亿元，同比增长21%；报告期内，公司国内线上票房51亿元，占国内票房超过80%；会员数量突破8000万。2016年公司观影人次1.85亿人次，同比增长22%。院线票房占全国电影总票房的比例达16.63%，比2015年高出2.33%。从成绩上讲，万达院线已经坐稳了国内影视业的头把交椅。然而，相比2016年年初，万达院线的股价却一路下跌，幅度超50%。体量带来的业绩增长2016年，中国电影市场总体表现不佳，电影总票房达457.12亿元，同比增长3.37%，增幅为近十年最低。受此影响，万达院线的经营数据相比2015年，并没有显得特别出色。2015年万达院线实现营收80亿元，同比增长49.9%，其中票房63亿元，同比增长49.6%；观影人次达1.51亿人次，同比增长48.9%。不过对比其他影视公司，万达院线的成绩可以算为优等。这一年，全国新增影院1612家，新增银幕9552块，银幕总数达到41179块，成为世界上电影银幕最多的国家。然而票房的小幅增长，银幕的疯狂增长，带来的就是银幕产出效率的低下。2016年中国电影市场单张银幕贡献的产出仅为111万元，与2015年单张银幕产出139.34万元相比，大幅降低28万元，降幅约20%。2016年，万达院线仍然在大举扩张。在这一年里，万达院线连续收购了19家影院，总开业影院376家；新增银幕762块，达3319块。在保持高速扩张的基础上，万达院线还实现了单张银幕产出超过220万元。",
      num:0,
      pinlun:[
         {
           person:"小明",
           text:"wwddawdadd"
         }
      ]
    },
    {
      title:"云南临沧市镇康县统战部副部长驾车肇事致两官员死亡",
      author:"春城晚报",
      content:"据镇康县政府办公室通报，2017年1月11日晚8:25分左右，37岁的镇康县委统战部副部长，工商联党组书记、副主席蒋钳虎驾驶一辆尼桑逍客 在南伞口岸与园区一号路连接线约一公里处肇事，造成53岁的镇康县国税局副局长袁永康，45岁镇康县国税局办公室主任罗桂君当场死亡。事故发生后，县委县政府高度重视，县委书记李玉学、县长董万春要求迅速查明事故原因，严惩肇事者，妥善处置死者善后工作，并指派县政府分管副县长迅速赶往现场做好善后处置。目前，肇事者蒋钳虎已被公安机关拘留，公安交警部门正在进一步查实事故原因。死者遗体已运送至殡仪馆，善后工作正在有序开展。",
      num:0,
      pinlun:[
         {
           person:"小明",
           text:"wwddawdadd"
         },
         {
           person:"小明",
           text:"wwddawdadd"
         }
      ]
    },
    {
      title:"四川一高校寒假作业被指奇葩：给学校双微点赞不过百视为挂科",
      author:"北京青年报",
      content:"北京青年报1月12日消息，昨日，有网友爆料，四川的一所高校给学生布置一项“特殊”的寒假作业，作业的内容是要求学生在寒假推广该校的官方公众号，并且要求有“点赞”，对于“点赞”数量还有特定的要求。对此，网友表示无法理解学校的想法。校方称，不知情或为学院领导的个人行为。据网友爆料，四川的一所高校在这个寒假给学生布置了一项特殊的寒假作业，作业要求学生在寒假推广该校的微博微信，点赞数不能低于100个，否则视为挂科。北京青年报记者从爆料人发布的微博截图中看到，一名疑似为校管理人员的人在某群中发布一则寒假安排，其中在寒假安排的第二项内容里提及安排寒假作业的内容，要求部署寒假期间，航空旅游与高铁学院的微博、微信推广，并附有评分标准等。据爆料人称，这所高校为四川科技职业学院，留这项作业的是该校的航空旅游与高铁学院。",
      num:0,
      pinlun:[
         {
           person:"小明",
           text:"wwddawdadd"
         }
      ]
    }
]

export function add(id){
    return{
        type:"ADD_NUM",
        id
    }
};

export function loading(){
    return {
        type:"LOADING",
        text:"loading..."
    }
}

export function data (){
    return{
        type:"DATA",
        data:newData
    }
}
export function post(){
   return dispatch =>{
       dispatch(loading);
       return setTimeout( () => dispatch(data()),1000)
   }
}

export function showConent(id){
  return{
    type:"SHOW_CONTENT",
    id
  }
}

export function showPin(id){
  return{
    type:"SHOW_PIN",
    id
  }
}

export function showList(){
  return{
    type:"SHOW_LIST"
  }
}
